[Language]
0x401=ARA
0x404=CHT
0x804=CHS
0x405=CZE
0x407=GER
0x409=ENG
0x40A=SPA
0x40C=FR
0x410=IT
0x411=JP
0x412=KO
0x413=DUT
;0x415=PL
0x416=BR
0x816=PT
0x419=RU
;0x424=SI

[ARA]
IDS_ATK =               "لا يمكن فتح برنامج التشغيل ACPI ATK0100 الخاص بوضع Kernel. يرجى أولاً تثبيت برنامج التشغيل هذا."
IDS_UNSUPPORTED =       "لا يتمكن برنامج Flash BIOS من التعرف على ملف BIOS. جرب إصدار آخر لملف BIOS."
IDS_REMINDER =          "سيقوم هذا البرنامج بتحديث BIOS. وتحديث BIOS فيه خطورة محتملة لذا ينصح بتحديث BIOS الخاص بك فقط إلا إذا كان هناك ضرورة ملحة لذلك. وقبل تحديث BIOS، يرجى قراءة معلومات إصدار BIOS المتاحة على موقع التنزيل. "
IDS_BROWSE =            "استعرض الملفات للعثور على ملف BIOS."
IDS_RECONFIRM =         "تحذير: قد يؤدي تحديث BIOS بصورة غير ملائمة إلى مزيد من المشاكل لجهازك المحمول. يرجى تحديث BIOS فقط إلا إذا كان هناك ضرورة ملحة لذلك. سيقوم WinFlash بتحديث BIOS وإعادة تمهيد النظام لديك.هل ترغب في المتابعة؟"
IDS_DEFAULT_ERROR =     "غير مسموح بتحديث BIOS. رمز الخطأ: "
IDS_UNFOUNDED_FILE =    "لا يمكن العثور على ملف BIOS: "
IDS_UNKNOWN_ROMTYPE =   "BIOS الحالي لا يمكنه التعرف على نوع BIOS ROM. "
IDS_UNKNOWN_SIGN =      "لا يوجد إصدار BIOS جديد."
IDS_ROM_INFO =          "معلومات BIOS ROM"
IDS_ROM_TYPE =          "نوع ROM:"
IDS_MODEL =             "طراز:"
IDS_VERSION =           "إصدار:"
IDS_DATE =              "تاريخ:"
IDS_IMAGE_INFO =        "معلومات صورة BIOS"
IDS_FILENAME =          "اسم الملف:"
IDS_MESSAGE =           "رسالة"
IDS_ERASE =             "تم مسح ROM"
IDS_FLASH =             "تم تحديث ROM"
IDS_VERIFY =            "تم التحقق من ROM"
IDS_EXIT =              "انقر فوق [Exit] للخروج. "
IDS_RETRY =             "انقر فوق [Flash] للمحاولة ثانية أو [Exit] لإيقاف البرنامج قبل الاكتمال."
IDS_FORMAT_CONFIMED =   "ملف BIOS صحيح. انقر فوق [Flash] لتحديث BIOS."
IDS_BACKUP_FAILED =     "فشل نسخ ملف BIOS احتياطيًا. "
IDS_INVALID_SIZE =      "حجم ملف BIOS غير صالح. "
IDS_BUF_ALLOC_FAILED =  "لا يمكن تخصيص ذاكرة مؤقتة لتخزين ملف BIOS. "
IDS_UNKNOWN_FILE_VER =  "لا يمكن العثور على إصدار ملف BIOS. "
IDS_UNKNOWN_BIOS_VER =  "لا يمكن العثور على إصدار BIOS ROM. "
IDS_MODEL_MISMATCHED =  "إصدار ملف BIOS غير متطابق مع إصدار BIOS ROM. "
IDS_DOWNGRADE =         "تحذير: ملف BIOS أقدم من الإصدار الحالي. "
IDS_ERASING =           "جاري مسح BIOS ROM... يرجى الانتظار لثوان حتى تتم العملية. تفادي إيقاف تشغيل النظام أثناء عملية الحذف حيث قد يؤدي ذلك إلى فشل النظام."
IDS_ERASE_FAILED =      "فشل مسح BIOS ROM. "
IDS_FLASHING =          "جاري تحديث BIOS ROM... يرجى الانتظار لثوان حتى تتم العملية. تفادي إيقاف تشغيل النظام أثناء عملية التحديث حيث قد يؤدي ذلك إلى فشل النظام."
IDS_FLASH_FAILED =      "فشل تحديث BIOS ROM."
IDS_VERIFYING =         "جاري التحقق من إصدار BIOS ROM... يرجى الانتظار لثوان حتى تتم العملية. تفادي إيقاف تشغيل النظام أثناء عملية التحقق حيث قد يؤدي ذلك إلى فشل النظام."
IDS_VERIFY_ALLOC =      "فشل تخصيص ذاكرة مؤقتة للتحقق من BIOS ROM."
IDS_VERIFY_FAILED =     "فشل مطابقة BIOS ROM مع ملف BIOS الجديد."
IDS_REBOOT =            "نجحت عملية التحديث. انقر فوق [Exit] لإعادة تمهيد النظام."
IDS_SHUTDOWN =          "تمت عملية التحديث بنجاح.  انقر فوق [Exit] لإيقاف تشغيل الجهاز. "
IDS_CMOS_CLEAR =        "يقوم CMOS بتحميل الإعدادات الافتراضية تلقائيًا."
IDS_ATP_NOTIME =        "Intel AT-p (تقنية حماية الكمبيوتر ضد السرقة) خطأ: قد يكون الوقت المتبقي غير كاف!"
IDS_POWER_PREREQUISITE ="قبل تشغيل البرنامج، تأكد من أن توصيل مهايئ الطاقة ووجود شحن بالبطارية يصل إلى 20% على الأقل."
IDS_INVALID_BIOS =      "ملف BIOS غير صالح"
IDS_REBOOT_SF20 =       "Click [Exit] for the system to auto-reboot and continue with the BIOS update process."

[CHT]
IDS_ATK =               "無法開啟ACPI ATK0100 Kernel 模式驅動程式。請先安裝此驅動程式。"
IDS_UNSUPPORTED =       "當前的 BIOS 版本不支援此版本的程式。請使用其他版本。" 
IDS_REMINDER =          "本程式將會更新您的 BIOS。只有在您的筆記型電腦有問題，且您知道新的 BIOS 修正版本將可解決您的問題時，才請更新您的 BIOS。（在使用之前，請先閱讀下載網站上所提供的 BIOS 釋出資訊）。如不小心更新，將會導致您的筆記型電腦出現更多的問題！"
IDS_BROWSE =            "請將 BIOS 影像檔案填入這裡。"
IDS_RECONFIRM =         "不適當的 BIOS 更新將會導致您的筆記型電腦產生更多的問題！WinFlash 將會升级 BIOS 並重新啟動您的系統。您要繼續嗎？"
IDS_DEFAULT_ERROR =     "不允許進行 BIOS 更新。錯誤代碼： "
IDS_UNFOUNDED_FILE =    "找不到 BIOS 影像檔案： "
IDS_UNKNOWN_ROMTYPE =   "目前的 BIOS 無法識別 EEPROM 類型。"
IDS_UNKNOWN_SIGN =      "沒有可更新的 BIOS。"
IDS_ROM_INFO =          "BIOS ROM 資訊"
IDS_ROM_TYPE =          "ROM 類型："
IDS_MODEL =             "機型："
IDS_VERSION =           "版本："
IDS_DATE =              "日期："
IDS_IMAGE_INFO =        "BIOS 影像資訊"
IDS_FILENAME =          "檔案名稱："
IDS_MESSAGE =           "訊息"
IDS_ERASE =             "刪除 ROM"
IDS_FLASH =             "快閃 ROM"
IDS_VERIFY =            "確認 ROM"
IDS_EXIT =              "請按下 [Exit] 按鈕來結束。"
IDS_RETRY =             "請按下 [Flash] 按鈕來再試一次，或按下 [Exit] 來放棄。"
IDS_FORMAT_CONFIMED =   "BIOS 影像檔格式正確，您可以按下 [Flash] 按鈕來更新 BIOS ROM"
IDS_BACKUP_FAILED =     "備份 BIOS 檔案失敗。"
IDS_INVALID_SIZE =      "BIOS 影像的檔案大小不正確。"
IDS_BUF_ALLOC_FAILED =  "無法配置緩衝區以儲存 BIOS 影像檔。"
IDS_UNKNOWN_FILE_VER =  "找不到 BIOS 影像檔版本。"
IDS_UNKNOWN_BIOS_VER =  "找不到 BIOS ROM 版本。"
IDS_MODEL_MISMATCHED =  "BIOS 影像檔版本與 BIOS ROM 版本不符。"
IDS_DOWNGRADE =         "警告！BIOS 版本日期早於當前 BIOS 版本。"
IDS_ERASING =           "BIOS正在更新中，請耐心等候兩到三分鐘至系統更新完畢。目前關閉動作無法執行，因這可能導致系統故障。"
IDS_ERASE_FAILED =      "無法刪除 EEPROM。"
IDS_FLASHING =          "BIOS正在更新中，請耐心等候兩到三分鐘至系統更新完畢。目前關閉動作無法執行，因這可能導致系統故障。"
IDS_FLASH_FAILED =      "無法更新 EEPROM。"
IDS_VERIFYING =         "BIOS正在更新中，請耐心等候兩到三分鐘至系統更新完畢。目前關閉動作無法執行，因這可能導致系統故障。"
IDS_VERIFY_ALLOC =      "無法針對確認來配置緩衝區。"
IDS_VERIFY_FAILED =     "無法確認含有新 BIOS 影像的 EEPROM。"
IDS_REBOOT =            "快閃成功！請按下 [EXIT] 來重新啟動系統。"
IDS_SHUTDOWN =          "更新成功！請按 [EXIT] 按鈕來關閉系統。"
IDS_CMOS_CLEAR =        "CMOS 將自動載入預設值。"
IDS_ATP_NOTIME =        "Intel AT-p (Anti-Theft Protection) 技術錯誤：剩餘時間可能不夠！"
IDS_POWER_PREREQUISITE ="在執行此程式之前，請確認您已連接電源變壓器，且電池的剩餘電量至少為 20%。"
IDS_INVALID_BIOS =      "無效 BIOS 檔案"
IDS_REBOOT_SF20 =       "點選「Exit」可讓系統自動重新啟動，且繼續 BIOS 更新程序。"

[CHS]
IDS_ATK =               "无法打开 ACPI ATK0100 Kernel 模式驱动程序。请先安装此驱动程序。"
IDS_UNSUPPORTED =       "当前的 BIOS 版本不支持此版本的程序。请使用其他版本。"
IDS_REMINDER =          "本程序将会升级您的 BIOS。只有在您的笔记本电脑有问题，且您知道新的 BIOS 修正版本将可解决您的问题时，才请升级您的 BIOS。（在使用之前，请先阅读下载网站上提供的 BIOS 版本信息）。如不小心升级，将会导致您的笔记本电脑出现更多的问题！"
IDS_BROWSE =            "请将 BIOS 影像文件填入这里。"
IDS_RECONFIRM =         "不适当的 BIOS 升级将会导致您的笔记本电脑产生更多的问题！ WinFlash 将会升级 BIOS 并重新启动您的系统。您要继续吗？"
IDS_DEFAULT_ERROR =     "不允许进行 BIOS 升级。错误代码： "
IDS_UNFOUNDED_FILE =    "找不到 BIOS 影像文件："
IDS_UNKNOWN_ROMTYPE =   "当前的 BIOS 无法识别 EEPROM 类型。"
IDS_UNKNOWN_SIGN =      "没有可升级的 BIOS。"
IDS_ROM_INFO =          "BIOS ROM 信息"
IDS_ROM_TYPE =          "ROM 类型："
IDS_MODEL =             "机型："
IDS_VERSION =           "版本："
IDS_DATE =              "日期："
IDS_IMAGE_INFO =        "BIOS 影像信息"
IDS_FILENAME =          "文件名"
IDS_MESSAGE =           "信息"
IDS_ERASE =             "删除 ROM"
IDS_FLASH =             "升级 ROM"
IDS_VERIFY =            "确认 ROM"
IDS_EXIT =              "请按下 [Exit] 按钮来结束。"
IDS_RETRY =             "请按下 [Flash] 按钮来再试一次，或按下 [Exit] 来放弃。"
IDS_FORMAT_CONFIMED =   "BIOS 影像文件格式正确，您可以按下 [Flash] 按钮来升级 BIOS ROM"
IDS_BACKUP_FAILED =     "备份 BIOS 文档失败。"
IDS_INVALID_SIZE =      "BIOS 影像的文件大小不正确。"
IDS_BUF_ALLOC_FAILED =  "无法配置缓冲区以保存 BIOS 影像文件。"
IDS_UNKNOWN_FILE_VER =  "找不到 BIOS 影像文件版本。"
IDS_UNKNOWN_BIOS_VER =  "找不到 BIOS ROM 版本。"
IDS_MODEL_MISMATCHED =  "BIOS 影像文件版本与 BIOS ROM 版本不符。"
IDS_DOWNGRADE =         "警告！BIOS 版本日期早于当前 BIOS 版本。"
IDS_ERASING =           "BIOS正在更新，请耐心等候两到三分钟至系统更新完毕。目前无法执行关闭动作，因为这样可能导致系统故障。"
IDS_ERASE_FAILED =      "无法删除 EEPROM。"
IDS_FLASHING =          "BIOS正在更新，请耐心等候两到三分钟至系统更新完毕。目前无法执行关闭动作，因为这样可能导致系统故障。"
IDS_FLASH_FAILED =      "无法升级 EEPROM。"
IDS_VERIFYING =         "BIOS正在更新，请耐心等候两到三分钟至系统更新完毕。目前无法执行关闭动作，因为这样可能导致系统故障。"
IDS_VERIFY_ALLOC =      "无法针对确认来配置缓冲区。"
IDS_VERIFY_FAILED =     "无法确认含有新 BIOS 影像的 EEPROM。"
IDS_REBOOT =            "升级成功！请按下 [Exit] 来重新启动系统。"
IDS_SHUTDOWN =          "升级成功！请按 [Exit] 按钮来关闭系统。"
IDS_CMOS_CLEAR =        "CMOS 将自动加载初始值。"
IDS_ATP_NOTIME =        "Intel AT-p（Anti-Theft Protection） 技术错误：剩余时间可能不够！"
IDS_POWER_PREREQUISITE ="在运行此程序之前，请确认您已连接电源适配器，且电池的剩余电量至少为 20%。"
IDS_INVALID_BIOS =      "无效 BIOS 文件"
IDS_REBOOT_SF20 =       "点击 「Exit」 可让系统自动重新启动，且继续进行 BIOS 更新。"

[CZE]
IDS_ATK =               "Nelze otevřít ovladač režimu jádra ACPI ATK0100. Nejdříve nainstalujte tento ovladač."
IDS_UNSUPPORTED =       "Program Flash BIOS nemůže rozpoznat soubor BIOS. Zkuste jinou verzi souboru BIOS."
IDS_REMINDER =          "Tento program zaktualizuje systém BIOS.Aktualizace systému BIOS je potenciálně riskantní, proto aktualizujte systém BIOS pouze, pokud je to zcela nezbytné. Před aktualizováním systému BIOS si přečtěte informace k vydání systému BIOS, které jsou k dispozici na serveru pro stahování."  
IDS_BROWSE =            "Vyhledejte soubor BIOS."
IDS_RECONFIRM =         "VAROVÁNÍ: Nevhodnou aktualizací systému BIOS mohou vzniknout další problémy s notebookem. Aktualizujte systém BIOS pouze, pokud je to zcela nezbytné. WinFlash zaktualizuje systém BIOS a restartuje váš počítač.Chcete pokračovat?"
IDS_DEFAULT_ERROR =     "Aktualizace systému BIOS není povolena. Kód chyby: "
IDS_UNFOUNDED_FILE =    "Nelze najít soubor BIOS: "
IDS_UNKNOWN_ROMTYPE =   "Aktuální systém BIOS nemůže rozpoznat typ BIOS ROM. "
IDS_UNKNOWN_SIGN =      "Není k dispozici nová verze systému BIOS."
IDS_ROM_INFO =          "Informace o paměti ROM systému BIOS"
IDS_ROM_TYPE =          "Typ paměti ROM:"
IDS_MODEL =             "Model:"
IDS_VERSION =           "Verze:"
IDS_DATE =              "Datum:"
IDS_IMAGE_INFO =        "Informace o bitové kopii systému BIOS"
IDS_FILENAME =          "Název souboru:"
IDS_MESSAGE =           "Zpráva"
IDS_ERASE =             "Vymazaná ROM"
IDS_FLASH =             "Přepsaná ROM"
IDS_VERIFY =            "Ověřená ROM"
IDS_EXIT =              "Klepnutím na [Exit] ukončete."
IDS_RETRY =             "Klepnutím na [Flash] akci zopakujte nebo stisknutím [Exit] akci ukončete."
IDS_FORMAT_CONFIMED =   "Soubor BIOS je správný. Klepnutím na [Flash] zaktualizujte systém BIOS."
IDS_BACKUP_FAILED =     "Nepodařilo se zazálohovat soubor BIOS. "
IDS_INVALID_SIZE =      "Velikost souboru BIOS je chybná. " 
IDS_BUF_ALLOC_FAILED =  "Nelze přidělit vyrovnávací paměť pro uložení souboru BIOS. "
IDS_UNKNOWN_FILE_VER =  "Nelze najít verzi souboru BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Nelze najít verzi BIOS ROM. "
IDS_MODEL_MISMATCHED =  "Verze souboru BIOS se neshoduje s verzí BIOS ROM. "
IDS_DOWNGRADE =         "VAROVÁNÍ: Soubor BIOS je starší, než aktuální verze. "
IDS_ERASING =           "Počkejte dvě až tři minuty na dokončení procesu aktualizace systému BIOS. Během tohoto procesu je funkce Power off (Vypnout) deaktivována, aby se zabránilo selhání systému."
IDS_ERASE_FAILED =      "Mazání BIOS ROM se nezdařilo. "
IDS_FLASHING =          "Počkejte dvě až tři minuty na dokončení procesu aktualizace systému BIOS. Během tohoto procesu je funkce Power off (Vypnout) deaktivována, aby se zabránilo selhání systému."
IDS_FLASH_FAILED =      "Aktualizace BIOS ROM se nezdařila. "
IDS_VERIFYING =         "Počkejte dvě až tři minuty na dokončení procesu aktualizace systému BIOS. Během tohoto procesu je funkce Power off (Vypnout) deaktivována, aby se zabránilo selhání systému."
IDS_VERIFY_ALLOC =      "Nepodařilo se přidělit vyrovnávací paměť pro ověření BIOS ROM. "
IDS_VERIFY_FAILED =     "Nepodařilo se sloučit BIOS ROM s novým souborem BIOS. "
IDS_REBOOT =            "Aktualizace byla úspěšná. Klepnutím na [Exit] restartujte systém. "
IDS_SHUTDOWN =          "Aktualizace byla úspěšná. Klepnutím na [Exit] vypněte systém. "
IDS_CMOS_CLEAR =        "CMOS automaticky zavede výchozí nastavení."
IDS_ATP_NOTIME =        "Chyba Intel AT-p (technologie ochrany PC proti krádeži): Zbývající čas nemusí být dostačující!"
IDS_POWER_PREREQUISITE ="Před spuštěním programu zkontrolujte, zda je připojen napájecí adaptér a zda zbývá alespoň 20 % energie baterie."
IDS_INVALID_BIOS =      "Neplatný soubor BIOS"
IDS_REBOOT_SF20 =       "Klepnutím na tlačítko [Exit] se systém automaticky restartuje a aktualizace systému BIOS bude pokračovat."

[GER]
IDS_ATK =               "Kann ACPI ATK0100 Kernelmodus-Treiber nicht öffnen. Installieren Sie bitte zuerst diesen Treiber."
IDS_UNSUPPORTED =       "Flash BIOS-Programm kann die BIOS-Datei nicht erkennen. Versuchen Sie eine andere BIOS-Dateiversion." 
IDS_REMINDER =          "Dieses Programm wird BIOS aktualisieren.BIOS-Aktualisierungen bergen potenzielle Risiken, eine Aktualisierung wird nur bei dringendem Bedarf empfohlen. Bevor Sie BIOS aktualisieren, lesen Sie die bereitgestellten Anmerkungen zur dieser Version auf der Download-Seite."
IDS_BROWSE =            "Nach der BIOS-Datei suchen."
IDS_RECONFIRM =         "WARNUNG: Unsachgemäße BIOS-Aktualisierung kann zu weiteren Problemen mit Ihrem Notebook PC führen. Aktualisieren Sie nur, wenn es absolut notwendig ist. WinFlash wird das BIOS aktualisieren und Ihren Computer neu starten. Möchten Sie fortfahren?"
IDS_DEFAULT_ERROR =     "BIOS-Aktualisierung nicht gestattet. Fehlercode: "
IDS_UNFOUNDED_FILE =    "Kann die BIOS-Datei nicht finden: "
IDS_UNKNOWN_ROMTYPE =   "Das derzeitige BIOS kann den BIOS ROM-Typ nicht erkennen. "
IDS_UNKNOWN_SIGN =      "Keine neue BIOS-Version vorhanden."
IDS_ROM_INFO =          "BIOS ROM Informationen"
IDS_ROM_TYPE =          "ROM-Typ:"
IDS_MODEL =             "Modell:"
IDS_VERSION =           "Version:"
IDS_DATE =              "Datum:"
IDS_IMAGE_INFO =        "BIOS Image (Abbild) Informationen"
IDS_FILENAME =          "Dateiname:"
IDS_MESSAGE =           "Nachricht"
IDS_ERASE =             "Gelöschtes ROM"
IDS_FLASH =             "Flashed ROM"
IDS_VERIFY =            "Geprüftes ROM"
IDS_EXIT =              "Auf [Exit] klicken, um zu verlassen."
IDS_RETRY =             "Auf [Flash] klicken, um erneut zu versuchen oder [Exit], um abzubrechen."
IDS_FORMAT_CONFIMED =   "Die BIOS-Datei ist zutreffend. Auf [Flash] klicken, um BIOS zu aktualisieren."
IDS_BACKUP_FAILED =     "BIOS-Dateibackup (Sicherung) fehlgeschlagen. "
IDS_INVALID_SIZE =      "Die BIOS-Dateigröße ist nicht gültig. "
IDS_BUF_ALLOC_FAILED =  "Kann keinen Puffer zuweisen, um die BIOS-Datei zu speichern. "
IDS_UNKNOWN_FILE_VER =  "Kann die BIOS-Dateiversion nicht finden. "
IDS_UNKNOWN_BIOS_VER =  "Kann die BIOS ROM-Version nicht finden. "
IDS_MODEL_MISMATCHED =  "BIOS-Dateiversion entspricht nicht der BIOS ROM-Version. "
IDS_DOWNGRADE =         "WARNUNG: Die BIOS-Datei ist älter als die aktuelle Version. "
IDS_ERASING =           "Warten Sie bitte zwei bis drei Minuten, bis der BIOS-Aktualisierungsvorgang beendet ist. Während dieses Vorgangs ist die Ausschaltfunktion deaktiviert, um einen Systemfehler zu vermeiden."
IDS_ERASE_FAILED =      "BIOS ROM-Löschen fehlgeschlagen. "
IDS_FLASHING =          "Warten Sie bitte zwei bis drei Minuten, bis der BIOS-Aktualisierungsvorgang beendet ist. Während dieses Vorgangs ist die Ausschaltfunktion deaktiviert, um einen Systemfehler zu vermeiden."
IDS_FLASH_FAILED =      "BIOS ROM-Aktualisierung fehlgeschlagen. "
IDS_VERIFYING =         "Warten Sie bitte zwei bis drei Minuten, bis der BIOS-Aktualisierungsvorgang beendet ist. Während dieses Vorgangs ist die Ausschaltfunktion deaktiviert, um einen Systemfehler zu vermeiden."
IDS_VERIFY_ALLOC =      "Pufferzuweisung für die BIOS ROM-Prüfung fehlgeschlagen. "
IDS_VERIFY_FAILED =     "Abstimmung zwischen BIOS ROM und neuer BIOS-Datei fehlgeschlagen. "
IDS_REBOOT =            "Aktualisierung erfolgreich. [Exit] klicken, um das System neu zu starten. "
IDS_SHUTDOWN =          "Aktualisierung erfolgreich. [Exit] klicken, um das System auszuschalten. "
IDS_CMOS_CLEAR =        "CMOS ladet automatisch die Standardeinstellungen."
IDS_ATP_NOTIME =        "Intel AT-p (Anti-Theft Technology PC Protection) Fehler: Nicht genügend verbleibender Zeit."
IDS_POWER_PREREQUISITE ="Bevor Sie das Programm ausführen, vergewissern Sie sich bitte, dass das Netzteil angeschlossen ist und die verbleibende Akkukapazität mindestens 20% beträgt."
IDS_INVALID_BIOS =      "Ungültige BIOS-Datei"
IDS_REBOOT_SF20 =       "Zum automatischen Neustart des Systems und zum Fortsetzen der BIOS-Aktualisierung klicken Sie auf [Exit]."

[ENG]
IDS_ATK =               "Cannot open ACPI ATK0100 kernel mode driver. Please install this driver first."
IDS_UNSUPPORTED =       "Flash BIOS Program cannot recognize the BIOS file. Try another BIOS file version." 
IDS_REMINDER =          "This program will update the BIOS.BIOS updating is potentially risky, so only update your BIOS unless it is absolutely neccessary. Before updating the BIOS, read the BIOS release information provided on the download site."
IDS_BROWSE =            "Browse for the BIOS file."
IDS_RECONFIRM =         "WARNING: Inappropriate BIOS updating may create more problems for your Notebook PC.Update the BIOS unless it is absolutely necessary. WinFlash will update the BIOS and reboot your system.Do you want to continue?"
IDS_DEFAULT_ERROR =     "BIOS update is not allowed. Error code: "
IDS_UNFOUNDED_FILE =    "Cannot find the BIOS file: "
IDS_UNKNOWN_ROMTYPE =   "The current BIOS cannot recognize the BIOS ROM type. "
IDS_UNKNOWN_SIGN =      "There is no new BIOS version."
IDS_ROM_INFO =          "BIOS ROM Information"
IDS_ROM_TYPE =          "ROM Type:"
IDS_MODEL =             "Model:"
IDS_VERSION =           "Version:"
IDS_DATE =              "Date:"
IDS_IMAGE_INFO =        "BIOS Image Information"
IDS_FILENAME =          "File Name:"
IDS_MESSAGE =           "Message"
IDS_ERASE =             "Erased ROM"
IDS_FLASH =             "Flashed ROM"
IDS_VERIFY =            "Verified ROM"
IDS_EXIT =              "Click [Exit] to exit."
IDS_RETRY =             "Click [Flash] to try again or [Exit] to abort."
IDS_FORMAT_CONFIMED =   "BIOS file is correct. Click [Flash] to update the BIOS."
IDS_BACKUP_FAILED =     "Failed to backup the BIOS file. "
IDS_INVALID_SIZE =      "The BIOS file size is not valid. "
IDS_BUF_ALLOC_FAILED =  "Cannot allocate buffer to store the BIOS file. "
IDS_UNKNOWN_FILE_VER =  "Cannot find the BIOS file version. "
IDS_UNKNOWN_BIOS_VER =  "Cannot find the BIOS ROM version. "
IDS_MODEL_MISMATCHED =  "The BIOS file version does not match the BIOS ROM version. "
IDS_DOWNGRADE =         "WARNING: The BIOS file is older than the current version. "
IDS_ERASING =           "Please wait for two to three minutes for the BIOS updating process to finish. During the process, the Power off function is disabled to prevent system failure."
IDS_ERASE_FAILED =      "Failed to erase the BIOS ROM. "
IDS_FLASHING =          "Please wait for two to three minutes for the BIOS updating process to finish. During the process, the Power off function is disabled to prevent system failure."
IDS_FLASH_FAILED =      "Failed to update the BIOS ROM. "
IDS_VERIFYING =         "Please wait for two to three minutes for the BIOS updating process to finish. During the process, the Power off function is disabled to prevent system failure."
IDS_VERIFY_ALLOC =      "Failed to allocate buffer for BIOS ROM verification. "
IDS_VERIFY_FAILED =     "Failed to match BIOS ROM with the new BIOS file. "
IDS_REBOOT =            "Updating is successful. Click [Exit] to reboot the system. "
IDS_SHUTDOWN =          "Updating is successful. Click [Exit] to shut down the system. "
IDS_CMOS_CLEAR =        "CMOS automatically loads the default settings."
IDS_ATP_NOTIME =        "Intel AT-p (Anti-Theft Technology PC Protection) Error: Remaining time might not be enough!"
IDS_POWER_PREREQUISITE ="Before running the program, ensure that the power adapter is plugged and the remaining battery power is at least 20%."
IDS_INVALID_BIOS =      "Invalid BIOS file"
IDS_REBOOT_SF20 =       "Click [Exit] for the system to auto-reboot and continue with the BIOS update process."

[SPA]
IDS_ATK =               "No se puede abrir el controlador de modo kernel ACPI ATK0100. Por favor, instale dicho controlador en primer lugar."
IDS_UNSUPPORTED =       "El programa de programación del BIOS no reconoce el archivo de BIOS. Pruebe con otra versión del archivo de BIOS." 
IDS_REMINDER =          "Este programa actualizará el BIOS.La actualización del BIOS es una operación potencialmente arriesgada y sólo debe llevarse a cabo si resulta absolutamente necesaria. Antes de actualizar el BIOS, lea la información relacionada con la versión del BIOS disponible en el sitio de descarga."
IDS_BROWSE =            "Busque el archivo del BIOS."
IDS_RECONFIRM =         "ADVERTENCIA: La actualización incorrecta del BIOS podría generar más problemas en su PC portátil. Actualice el BIOS sólo si resulta absolutamente necesario. WinFlash actualizará el BIOS y reiniciará su sistema.¿Desea continuar?"
IDS_DEFAULT_ERROR =     "No se permite actualizar el BIOS. Código de error: "
IDS_UNFOUNDED_FILE =    "No se encuentra el archivo del BIOS: "
IDS_UNKNOWN_ROMTYPE =   "El BIOS actual no reconoce el tipo de memoria ROM BIOS. "
IDS_UNKNOWN_SIGN =      "No hay ninguna versión nueva del BIOS."
IDS_ROM_INFO =          "Información acerca de la memoria ROM BIOS"
IDS_ROM_TYPE =          "Tipo de memoria ROM:"
IDS_MODEL =             "Modelo:"
IDS_VERSION =           "Versión:"
IDS_DATE =              "Fecha:"
IDS_IMAGE_INFO =        "Información acerca de la imagen del BIOS"
IDS_FILENAME =          "Nombre de archivo:"
IDS_MESSAGE =           "Mensaje"
IDS_ERASE =             "ROM borrada"
IDS_FLASH =             "ROM programada"
IDS_VERIFY =            "ROM verificada"
IDS_EXIT =              "Haga clic en [Exit] para salir."
IDS_RETRY =             "Haga clic en [Flash] para intentarlo de nuevo o en [Exit] para anular la operación."
IDS_FORMAT_CONFIMED =   "El archivo de BIOS es correcto. Haga clic en [Flash] para actualizar el BIOS."
IDS_BACKUP_FAILED =     "Error al crear la copia de seguridad del archivo de BIOS. "
IDS_INVALID_SIZE =      "El tamaño del archivo de BIOS no es válido. "
IDS_BUF_ALLOC_FAILED =  "No se puede asignar memoria de búfer para guardar el archivo de BIOS. "
IDS_UNKNOWN_FILE_VER =  "No se encuentra la versión del archivo de BIOS. "
IDS_UNKNOWN_BIOS_VER =  "No se encuentra la versión de la memoria ROM BIOS. "
IDS_MODEL_MISMATCHED =  "La versión del archivo de BIOS no coincide con la versión de la memoria ROM BIOS. "
IDS_DOWNGRADE =         "ADVERTENCIA: El archivo de BIOS es anterior a la versión actual. "
IDS_ERASING =           "Por favor, espere dos o tres minutos mientras se lleva a cabo el proceso de actualización del BIOS. La función de apagado permanecerá deshabilitada a lo largo del proceso con objeto de evitar posibles fallos en el sistema."
IDS_ERASE_FAILED =      "Error al borrar la memoria ROM BIOS. "
IDS_FLASHING =          "Por favor, espere dos o tres minutos mientras se lleva a cabo el proceso de actualización del BIOS. La función de apagado permanecerá deshabilitada a lo largo del proceso con objeto de evitar posibles fallos en el sistema."
IDS_FLASH_FAILED =      "Error al actualizar la memoria ROM BIOS. "
IDS_VERIFYING =         "Por favor, espere dos o tres minutos mientras se lleva a cabo el proceso de actualización del BIOS. La función de apagado permanecerá deshabilitada a lo largo del proceso con objeto de evitar posibles fallos en el sistema."
IDS_VERIFY_ALLOC =      "Error al asignar memoria de búfer a la verificación de la memoria ROM BIOS. "
IDS_VERIFY_FAILED =     "Error al comparar la memoria ROM BIOS con el nuevo archivo de BIOS. "
IDS_REBOOT =            "La actualización se ha realizado correctamente. Haga clic en [Exit] para reiniciar el sistema."
IDS_SHUTDOWN =          "La actualización se ha realizado correctamente. Haga clic en [Exit] para apagar el sistema."
IDS_CMOS_CLEAR =        "La memoria CMOS cargará automáticamente la configuración predeterminada."
IDS_ATP_NOTIME =        "Intel AT-p (tecnología de protección antirrobo para PC) Error: Es posible que el tiempo restante no sea suficiente."
IDS_POWER_PREREQUISITE ="Antes de ejecutar el programa, asegúrese de que el adaptador de alimentación se encuentre conectado y de que el nivel de carga restante en la batería sea superior al 20%."
IDS_INVALID_BIOS =      "Archivo del BISO no válido"
IDS_REBOOT_SF20 =       "Haga clic en [Exit] para que el sistema se reinicie automáticamente y continúe con el proceso de actualización del BIOS."

[FR]
IDS_ATK =               "Impossible d'ouvrir le pilote du mode kernel ACPI ATK0100. Veuillez installer ce pilote au préalable."
IDS_UNSUPPORTED =       "Le programme de mise à jour du BIOS ne reconnaît pas le fichier BIOS. Veuillez réessayer avec une autre version du BIOS." 
IDS_REMINDER =          "Ce programme vous aide à mettre à jour le BIOS.La mise à jour du BIOS étant est potientiellement dangereuse, mettez à jour le BIOS uniquement lorsque cette opération est nécessaire. Avant de mettre à jour le BIOS, lisez les informations concernant le BIOS fournies sur notre site de téléchargement."
IDS_BROWSE =            "Parcourir pour rechercher le fichier BIOS."
IDS_RECONFIRM =         "AVERTISSEMENT : une mise à jour incorrecte du BIOS peut créer de nombreux problèmes sur votre PC portable. Mettez à jour le BIOS uniquement si nécessaire. WinFlash mettra à jour le BIOS et redémarrera votre système.Souhaitez-vous continuer ?"
IDS_DEFAULT_ERROR =     "La mise à jour du BIOS n'est pas autorisée. Code erreur: "
IDS_UNFOUNDED_FILE =    "Impossible de détecter le fichier BIOS: "
IDS_UNKNOWN_ROMTYPE =   "La version actuelle du BIOS ne reconnaît pas le type de ROM BIOS. "
IDS_UNKNOWN_SIGN =      "Il n'y a pas de nouvelle version du BIOS disponible."
IDS_ROM_INFO =          "Informations sur la ROM du BIOS"
IDS_ROM_TYPE =          "Type de ROM:"
IDS_MODEL =             "Modèle :"
IDS_VERSION =           "Version :"
IDS_DATE =              "Date :"
IDS_IMAGE_INFO =        "Informations sur l'image BIOS" 
IDS_FILENAME =          "Nom de fichier :"
IDS_MESSAGE =           "Message"
IDS_ERASE =             "ROM effacée"
IDS_FLASH =             "ROM mise à jour"
IDS_VERIFY =            "ROM vérifiée"
IDS_EXIT =              "Cliquez sur [Exit] pour quitter."
IDS_RETRY =             "Cliquez sur [Flash] pour réessayer ou sur [Exit] pour annuler."
IDS_FORMAT_CONFIMED =   "Le fichier BIOS est correct. Cliquez sur [Flash] pour mettre à jour le BIOS." 
IDS_BACKUP_FAILED =     "Echec de la sauvegarde du fichier BIOS. "
IDS_INVALID_SIZE =      "La taille du fichier BIOS n'est pas valide. " 
IDS_BUF_ALLOC_FAILED =  "Impossible d'allouer de la mémoire tampon pour sauvegarder le fichier BIOS. "
IDS_UNKNOWN_FILE_VER =  "Impossible de détecter la version du fichier BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Impossible de détecter la version de la ROM BIOS. "
IDS_MODEL_MISMATCHED =  "La version du fichier BIOS ne correspond pas à la version de la ROM BIOS. "
IDS_DOWNGRADE =         "AVERTISSEMENT : le fichier BIOS est plus ancien que la version actuellement utilisée. "
IDS_ERASING =           "Veuillez patienter 2 à 3 minutes le temps que le processus de mise à jour du BIOS se termine. La fonction d'arrêt du système est temporairement désactivée lors de la mise à jour pour éviter un éventuel dysfonctionnement du système."
IDS_ERASE_FAILED =      "Echec de l'effacement de la ROM BIOS. "
IDS_FLASHING =          "Veuillez patienter 2 à 3 minutes le temps que le processus de mise à jour du BIOS se termine. La fonction d'arrêt du système est temporairement désactivée lors de la mise à jour pour éviter un éventuel dysfonctionnement du système."
IDS_FLASH_FAILED =      "Echec de la mise à jour de la ROM BIOS. "
IDS_VERIFYING =         "Veuillez patienter 2 à 3 minutes le temps que le processus de mise à jour du BIOS se termine. La fonction d'arrêt du système est temporairement désactivée lors de la mise à jour pour éviter un éventuel dysfonctionnement du système."
IDS_VERIFY_ALLOC =      "Echec de l'allocation de mémoire tampon pour vérifier la ROM BIOS. "
IDS_VERIFY_FAILED =     "Impossible de faire correspondre la ROM BIOS avec le nouveau fichier BIOS. "
IDS_REBOOT =            "La mise à jour a été effectuée avec succès. Cliquez sur [Exit] pour redémarrer le système. "
IDS_SHUTDOWN =          "LA mise à jour a été effectuée avec succès. Cliquez sur [Exit] pour éteindre le système. "
IDS_CMOS_CLEAR =        "La mémoire CMOS charge automatiquement les paramètres par défaut."
IDS_ATP_NOTIME =        "Erreur Intel AT-p (Anti-Theft Technology PC Protection) : le temps restant n'est pas suffisant !"
IDS_POWER_PREREQUISITE ="Avant d'exécuter le programme, veuillez vérifier que l'adaptateur secteur est bien connecté et que la charge batterie restante est d'au moins 20%."
IDS_INVALID_BIOS =      "Fichier BIOS invalide"
IDS_REBOOT_SF20 =       "Cliquez sur [Exit] pour redémarrer le système et poursuivre le processus de mise à jour du BIOS."

[IT]
IDS_ATK =               "Impossibile aprire il driver in modalità ACPI ATK0100 kernel. Installare prima questo driver."
IDS_UNSUPPORTED =       "Il programma Flash del BIOS non riconosce il file BIOS. Provare un'altra versione BIOS."  
IDS_REMINDER =          "Questo è un programma di aggiornamento del BIOS.L'aggiornamento del BIOS è potenzialmente rischioso, pertanto l'operazione deve essere eseguita soltanto se assolutamente necessaria.Prima di procedere, leggere le informazioni sulla versione BIOS fornite sul sito del download."
IDS_BROWSE =            "Cercare il file del BIOS."
IDS_RECONFIRM =         "AVVERTENZA: un inopportuno aggiornamento del BIOS potrebbe creare ulteriori problemi al vostro Notebook PC.Aggiornare il BIOS soltanto se assolutamente necessario. WinFlash aggiornerà il BIOS e riavvierà il sistema.Desiderate continuare?"
IDS_DEFAULT_ERROR =     "Aggiornamento BIOS non consentito. Codice errore: "
IDS_UNFOUNDED_FILE =    "Impossibile trovare il file del BIOS: "
IDS_UNKNOWN_ROMTYPE =   "Con il BIOS attuale è impossibile riconoscere il tipo di ROM del BIOS. "
IDS_UNKNOWN_SIGN =      "Non esiste alcuna nuova versione del BIOS."
IDS_ROM_INFO =          "Informazioni sulla ROM del BIOS"
IDS_ROM_TYPE =          "Tipo di ROM:"
IDS_MODEL =             "Modello:"
IDS_VERSION =           "Versione:"
IDS_DATE =              "Data:"
IDS_IMAGE_INFO =        "Informazioni sull'immagine del BIOS"
IDS_FILENAME =          "Nome File:"
IDS_MESSAGE =           "Messaggio"
IDS_ERASE =             "ROM Cancellata"
IDS_FLASH =             "ROM Aggiornata" 
IDS_VERIFY =            "ROM Verificata"
IDS_EXIT =              "Cliccare [Exit] per uscire."
IDS_RETRY =             "Cliccare [Flash] per riprovare o [Exit] per uscire."
IDS_FORMAT_CONFIMED =   "Il file del BIOS è corretto. Cliccare [Flash] per aggiornare il BIOS."
IDS_BACKUP_FAILED =     "Errore di backup del file BIOS."
IDS_INVALID_SIZE =      "Dimensioni file BIOS non valide. " 
IDS_BUF_ALLOC_FAILED =  "Impossibile allocare il buffer per salvare il file del BIOS. "
IDS_UNKNOWN_FILE_VER =  "Impossibile trovare la versione del file BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Impossibile trovare la versione ROM del BIOS. "
IDS_MODEL_MISMATCHED =  "La versione del file BIOS non è compatibile con la versione ROM del BIOS. "
IDS_DOWNGRADE =         "AVVERTENZA: Il file BIOS è anteriore alla versione attualmente in uso. "
IDS_ERASING =           "Attendere due o tre minuti, sino a quando il processo di aggiornamento del BIOS non sarà terminato.Nel corso dell'operazione, non sarà possibile spegnere il dispositivo, per evitare un arresto, anche accidentale, del sistema."
IDS_ERASE_FAILED =      "Cancellazione ROM del BIOS non riuscita. "
IDS_FLASHING =          "Attendere due o tre minuti, sino a quando il processo di aggiornamento del BIOS non sarà terminato.Nel corso dell'operazione, non sarà possibile spegnere il dispositivo, per evitare un arresto, anche accidentale, del sistema."
IDS_FLASH_FAILED =      "Aggiornamento ROM del BIOS non riuscito. "
IDS_VERIFYING =         "Attendere due o tre minuti, sino a quando il processo di aggiornamento del BIOS non sarà terminato.Nel corso dell'operazione, non sarà possibile spegnere il dispositivo, per evitare un arresto, anche accidentale, del sistema."
IDS_VERIFY_ALLOC =      "Errore di allocazione del buffer per la verifica ROM del BIOS. "
IDS_VERIFY_FAILED =     "Impossbile aggiornare la ROM BIOS con il nuovo file BIOS. "
IDS_REBOOT =            "Aggiornamento riuscito! Cliccare [Exit] per riavviare il sistema. "
IDS_SHUTDOWN =          "Aggiornamento riuscito! Cliccare [Exit] per arrestare il sistema. "
IDS_CMOS_CLEAR =        "La CMOS carica automaticamente le impostazioni predefinite."
IDS_ATP_NOTIME =        "Intel AT-p (Anti-Theft Technology PC Protection) Errore: il tempo a disposizione potrebbe essere insufficiente!"
IDS_POWER_PREREQUISITE ="Prima di eseguire il programma, assicurarsi di aver collegato l'adattatore di corrente e verificare che la carica residua della batteria non sia inferiore al 20%."
IDS_INVALID_BIOS =      "File BIOS non valido."
IDS_REBOOT_SF20 =       "Cliccate su [Exit] per riavviare il sistema e completare l'aggiornamento del BIOS."

[JP]
IDS_ATK =               "ACPI ATK0100 カーネルモードドライバーを開くことができませんでした。プログラムを実行する前にATK0100 ACPI ドライバーをインストールしてください。"
IDS_UNSUPPORTED =       "Flash BIOS Program は、BIOSファイルを認識することができませんでした。他のBIOSファイルのバージョンで試してください。" 
IDS_REMINDER =          "このプログラムは、Windows上でBIOSの更新を行います。 BIOSになんらかの問題が発生した場合や、新しいBIOSにより問題を解決できる場合にのみBIOSの更新を行ってください。（BIOSの更新を行う前に、ダウンロードサイトにあるBIOSのリリース情報を必ず御一読ください。"
IDS_BROWSE =            "BIOSファイルを指定してください。"
IDS_RECONFIRM =         "警告：不適切なBIOSの更新により、ノートパソコンにさらなる問題を引き起こす可能性があります。必要な場合にのみBIOSの更新を行ってください。WinFlashは、BIOSの更新を行い、システムを再起動します。作業を続けてもよろしいですか？"
IDS_DEFAULT_ERROR =     "BIOS更新できません。エラーコード: "
IDS_UNFOUNDED_FILE =    "BIOSファイルを見つけることができません: "
IDS_UNKNOWN_ROMTYPE =   "現在のBIOSはBIOS ROMタイプを認識することができません。"
IDS_UNKNOWN_SIGN =      "更新可能なBIOSはありません。"
IDS_ROM_INFO =          "現在のBIOS ROM情報"
IDS_ROM_TYPE =          "ROM タイプ:"
IDS_MODEL =             "モデル:"
IDS_VERSION =           "バージョン:"
IDS_DATE =              "日付:"
IDS_IMAGE_INFO =        "BIOSファイル情報"
IDS_FILENAME =          "ファイル名:"
IDS_MESSAGE =           "注意"
IDS_ERASE =             "消去"
IDS_FLASH =             "更新"
IDS_VERIFY =            "ベリファイ"
IDS_EXIT =              "[Exit]をクリックし終了します。"
IDS_RETRY =             "[Flash]をクリックし再試行するか、[Exit]をクリックし中止します。"
IDS_FORMAT_CONFIMED =   "BIOSファイルは正常です。[Flash]をクリックし、BIOSを更新します。"
IDS_BACKUP_FAILED =     "BIOSファイルのバックアップに失敗しました。"
IDS_INVALID_SIZE =      "このBIOSのファイルサイズは有効ではありません。"
IDS_BUF_ALLOC_FAILED =  "BIOSファイルを記憶するバッファーを割り当てることができません。"
IDS_UNKNOWN_FILE_VER =  "BIOSファイルのバージョンを特定できません。"
IDS_UNKNOWN_BIOS_VER =  "BIOS ROMのバージョンを特定できません。"
IDS_MODEL_MISMATCHED =  "BIOSファイルのモデルと、BIOS ROMのモデルが一致しません。"
IDS_DOWNGRADE =         "警告！このBIOSファイルは、現在のBIOSより古いバージョンです。"
IDS_ERASING =           "BIOS更新には数分間かかります。更新作業中はシステムを保護するため、電源ボタン及びスタートメニューからのシャットダウンは無効になります。"
IDS_ERASE_FAILED =      "BIOS ROMを消去することに失敗しました。"
IDS_FLASHING =          "BIOS更新には数分間かかります。更新作業中はシステムを保護するため、電源ボタン及びスタートメニューからのシャットダウンは無効になります。"
IDS_FLASH_FAILED =      "BIOS ROMの更新に失敗しました。"
IDS_VERIFYING =         "BIOS更新には数分間かかります。更新作業中はシステムを保護するため、電源ボタン及びスタートメニューからのシャットダウンは無効になります。"
IDS_VERIFY_ALLOC =      "BIOS ROMの検証のためのバッファーを割り当てることに失敗しました。"
IDS_VERIFY_FAILED =     "BIOS ROMと新しいBIOSファイルとの適合に失敗しました。"
IDS_REBOOT =            "更新に成功しました。[Exit]をクリックし、システムを再起動してください。"
IDS_SHUTDOWN =          "更新に成功しました。[Exit]をクリックしてシステムをシャットダウンします。"
IDS_CMOS_CLEAR =        "CMOSは、自動的に初期設定をロードします。"
IDS_ATP_NOTIME =        "Intel AT-p (Anti-Theft Technology PC Protection) エラー: 残り時間が足りません！"
IDS_POWER_PREREQUISITE ="プログラムを起動する前に、バッテリーパックの取り付けと、電源接続を確認してください。また、バッテリーパックの充電残量が20%以上であることを確認してください。"
IDS_INVALID_BIOS =      "無効なBIOSファイルです。"
IDS_REBOOT_SF20 =       "「Exit」をクリックし、システム再起動とBIOS更新を実行します。"

[KO]
IDS_ATK =               "ACPI ATK100 커널 모드의 드라이버를 열 수 없습니다. 먼저 드라이버를 설치해 주십시오."
IDS_UNSUPPORTED =       "BIOS 플래시 프로그램이 BIOS 파일을 인식할 수 없습니다. 다른 BIOS 파일 버전을 사용해 주십시오."
IDS_REMINDER =          "프로그램이 BIOS 를 업데이트하게 됩니다. BIOS 업데이트 과정은 위험을 내포하고 있으므로, 반드시 필요한 경우에만 BIOS 업데이트를 진행해 주십시오. BIOS 를 업데이트하기 전에 다운로드 사이트에 기재된 BIOS 배포 정보를 먼저 확인해 주십시오."
IDS_BROWSE =            "업데이트할 BIOS 파일을 찾아 주십시오."
IDS_RECONFIRM =         "경고: 올바르지 않은 BIOS 업데이트는 노트북 PC 에 심각한 문제를 일으킬 수 있습니다. 반드시 필요한 경우에만 BIOS 업데이트를 진행해 주십시오. WinFlash 는 BIOS 업데이트를 완료한 후에 시스템을 다시 시작하게 됩니다.계속 진행하시겠습니까?"
IDS_DEFAULT_ERROR =     "BIOS 업데이트가 허용되지 않습니다. 에러 코드: "
IDS_UNFOUNDED_FILE =    "BIOS 파일을 찾을 수 없습니다: "
IDS_UNKNOWN_ROMTYPE =   "현재 BIOS가 업데이트하려는 BIOS ROM 방식을 인식할 수 없습니다. "
IDS_UNKNOWN_SIGN =      "새 BIOS 버전이 존재하지 않습니다."
IDS_ROM_INFO =          "BIOS ROM 정보"
IDS_ROM_TYPE =          "ROM 방식:"
IDS_MODEL =             "모델:"
IDS_VERSION =           "버전:"
IDS_DATE =              "날짜:"
IDS_IMAGE_INFO =        "BIOS 이미지 정보"
IDS_FILENAME =          "파일명"
IDS_MESSAGE =           "메시지"
IDS_ERASE =             "ROM 제거"
IDS_FLASH =             "ROM 플래시"
IDS_VERIFY =            "ROM 확인"
IDS_EXIT =              "[Exit] 를 클릭하면 과정을 종료합니다."
IDS_RETRY =             "[Flash] 를 클릭하여 다시 시도하거나, [Exit] 를 클릭하여 중지해 주십시오."
IDS_FORMAT_CONFIMED =   "BIOS 파일이 올바르지 않습니다. [Flash] 를 클릭하여 BIOS 를 업데이트해 주십시오."
IDS_BACKUP_FAILED =     "BIOS 파일 백업 실패. "
IDS_INVALID_SIZE =      "BIOS 의 파일 크기가 올바르지 않습니다. "
IDS_BUF_ALLOC_FAILED =  "BIOS 파일을 저장하기 위한 버퍼를 할당할 수 없습니다. "
IDS_UNKNOWN_FILE_VER =  "BIOS 파일 버전을 찾을 수 없습니다. "
IDS_UNKNOWN_BIOS_VER =  "BIOS ROM 버전을 찾을 수 없습니다. "
IDS_MODEL_MISMATCHED =  "BIOS 파일 버전이 BIOS ROM 버전과 일치하지 않습니다. "
IDS_DOWNGRADE =         "경고: 업데이트하려는 BIOS 파일이 현재 버전보다 오래된 버전입니다. "
IDS_ERASING =           "BIOS 업데이트 과정이 끝날 때까지 약 2-3분이 소요되니 기다려 주십시오. 업데이트 과정 동안 시스템 실패를 예방하기 위해 전원 끄기 기능을 사용할 수 없습니다."
IDS_ERASE_FAILED =      "BIOS ROM 삭제 실패. "
IDS_FLASHING =          "BIOS 업데이트 과정이 끝날 때까지 약 2-3분이 소요되니 기다려 주십시오. 업데이트 과정 동안 시스템 실패를 예방하기 위해 전원 끄기 기능을 사용할 수 없습니다."
IDS_FLASH_FAILED =      "BIOS ROM 업데이트 실패. "
IDS_VERIFYING =         "BIOS 업데이트 과정이 끝날 때까지 약 2-3분이 소요되니 기다려 주십시오. 업데이트 과정 동안 시스템 실패를 예방하기 위해 전원 끄기 기능을 사용할 수 없습니다."
IDS_VERIFY_ALLOC =      "BIOS ROM 확인 과정을 위한 버퍼 할당 실패. "
IDS_VERIFY_FAILED =     "BIOS ROM 과 새 BIOS 파일이 일치하지 않음. "
IDS_REBOOT =            "업데이트 완료. [Exit] 를 클릭하여 시스템을 다시 시작해 주십시오. "
IDS_SHUTDOWN =          "업데이트 완료. [Exit] 를 클릭하여 시스템을 종료해 주십시오. "
IDS_CMOS_CLEAR =        "CMOS 는 자동으로 기본 설정을 불러옵니다."
IDS_ATP_NOTIME =        "Intel AT-p(Anti-Theft Technology PC Protection) 에러: 남은 시간이 충분치 않습니다!"
IDS_POWER_PREREQUISITE ="프로그램을 실행하기 전에 전원 어댑터가 연결되었고 배터리 전원 잔량이 최소 20%인지 확인하십시오."
IDS_INVALID_BIOS =      "무효 BIOS 파일"
IDS_REBOOT_SF20 =       "시스템에 대한 [Exit] 를 클릭하여 자동으로 다시 부팅하여 BIOS 업데이트 프로세스를 계속하십시오."

[DUT]
IDS_ATK =               "Kan stuurprogramma voor ACPI ATK0100 kernelmodus niet openen. Installeer eerst dit stuurprogramma."
IDS_UNSUPPORTED =       "Het Flash BIOS-programma kan het BIOS-bestand niet herkennen. Probeer een andere BIOS-bestandsversie."  
IDS_REMINDER =          "Dit programma voert een BIOS-update uit.Een BIOS-update is potentieel riskant, voer een BIOS-update dus alleen uit indien absoluut noodzakelijk. Lees de uitgifte-informatie op de downloadsite voordat u de BIOS-update uitvoert."
IDS_BROWSE =            "Het BIOS-bestand zoeken."
IDS_RECONFIRM =         "WAARSCHUWING: Een foute BIOS-update kan problemen opleveren voor uw notebook-pc. Voer een BIOS-update alleen uit indien absoluut noodzakelijk. WinFlash zal de update van de BIOS uitvoeren en uw systeem opnieuw opstarten.Wilt u doorgaan?"
IDS_DEFAULT_ERROR =     "BIOS-update niet toegestaan. Foutcode: "
IDS_UNFOUNDED_FILE =    "Kan het BIOS-bestand niet vinden: "
IDS_UNKNOWN_ROMTYPE =   "De huidige BIOS kan het type BIOS ROM niet herkennen. "
IDS_UNKNOWN_SIGN =      "Er is geen nieuwe BIOS-versie."
IDS_ROM_INFO =          "BIOS ROM-informatie"
IDS_ROM_TYPE =          "ROM-type:"
IDS_MODEL =             "Model:"
IDS_VERSION =           "Versie:"
IDS_DATE =              "Datum:"
IDS_IMAGE_INFO =        "BIOS-gegevens"
IDS_FILENAME =          "Bestandsnaam:"
IDS_MESSAGE =           "Melding"
IDS_ERASE =             "Gewiste ROM"
IDS_FLASH =             "ROM-update"
IDS_VERIFY =            "Geverifieerde ROM"
IDS_EXIT =              "Klik op [Exit] om af te sluiten."
IDS_RETRY =             "Klik op [Flash] om het opnieuw te proberen en op [Exit] om de handeling af te breken."
IDS_FORMAT_CONFIMED =   "BIOS-bestand is correct. Klik op [Flash] om de BIOS-update uit te voeren."
IDS_BACKUP_FAILED =     "Kon geen back-up uitvoeren van het BIOS-bestand. "
IDS_INVALID_SIZE =      "De BIOS-bestandsgrootte is ongeldig. " 
IDS_BUF_ALLOC_FAILED =  "Kan geen buffer toewijzen om het BIOS-bestand op te slaan. "
IDS_UNKNOWN_FILE_VER =  "Kan de BIOS-bestandsversie niet vinden. "
IDS_UNKNOWN_BIOS_VER =  "Kan de BIOS ROM-versie niet vinden. "
IDS_MODEL_MISMATCHED =  "De BIOS-bestandsversie komt niet overeen met de BIOS ROM-versie. " 
IDS_DOWNGRADE =         "WAARSCHUWING: Het BIOS-bestand is ouder dan de huidige versie. "
IDS_ERASING =           "Wacht twee tot drie minuten op de voltooiing van het BIOS-updateproces. Tijdens het proces is de Uitschakelingsfunctie uitgeschakeld om systeemstoringen te vermijden."
IDS_ERASE_FAILED =      "Kon de BIOS ROM niet wissen. "
IDS_FLASHING =          "Wacht twee tot drie minuten op de voltooiing van het BIOS-updateproces. Tijdens het proces is de Uitschakelingsfunctie uitgeschakeld om systeemstoringen te vermijden."
IDS_FLASH_FAILED =      "Kon geen BIOS ROM-update uitvoeren. "
IDS_VERIFYING =         "Wacht twee tot drie minuten op de voltooiing van het BIOS-updateproces. Tijdens het proces is de Uitschakelingsfunctie uitgeschakeld om systeemstoringen te vermijden."
IDS_VERIFY_ALLOC =      "Kon geen buffer toewijzen voor de BIOS ROM-verificatie. "
IDS_VERIFY_FAILED =     "Kon de BIOS ROM niet overeenstemmen met het nieuwe BIOS-bestand. "
IDS_REBOOT =            "De update is geslaagd. Klik op [Exit] om het systeem opnieuw op te starten."
IDS_SHUTDOWN =          "De update is geslaagd. Klik op [Exit] om het systeem uit te schakelen."
IDS_CMOS_CLEAR =        "De CMOS laadt automatisch de standaardinstellingen."
IDS_ATP_NOTIME =        "Intel AT-p (Antidiefstaltechnologie pc-beveiliging) fout: De resterende tijd volstaat mogelijk niet!"
IDS_POWER_PREREQUISITE ="Voordat u het programma uitvoert, moet u controleren of de voedingsadapter is aangesloten en of het resterende batterijvermogen minstens 20% is."
IDS_INVALID_BIOS =      "Ongeldig BIOS-bestand"
IDS_REBOOT_SF20 =       "Klik op [Exit] zodat het systeem automatisch opnieuw opstart en ga verder met de update van de BIOS."

[PL]
IDS_ATK =               "Nie można otworzyć sterownika trybu kernel ACPI ATK0100. Najpierw należy zainstalować sterownik."
IDS_UNSUPPORTED =       "Program Flash BIOS nie rozpoznaje pliku BIOS. Spróbuj użyć inną wersję pliku BIOS."  
IDS_REMINDER =          "Ten program wykonuje aktualizację BIOS.Aktualizacja BIOS jest potencjalnie niebezpieczna, dlatego BIOS należy aktualizować, jeśli jest to absolutnie niezbędne. Przed aktualizacją BIOS należy przeczytać na stronie pobierania informacje dotyczące BIOS."
IDS_BROWSE =            "Przeglądaj w celu odszukania pliku BIOS."
IDS_RECONFIRM =         "OSTRZEŻENIE: Niewłaściwa aktualizacja BIOS może spowodować więcej problemów z komputerem notebook PC. BIOS należy aktualizować, jeśli jest to absolutnie niezbędne. WinFlash wykona aktualizację BIOS i ponownie uruchomi system.Czy chcesz kontynuować?"
IDS_DEFAULT_ERROR =     "Nie można zaktualizować BIOS. Kod błędu: "
IDS_UNFOUNDED_FILE =    "Nie można znaleźć pliku BIOS: "
IDS_UNKNOWN_ROMTYPE =   "Bieżąca wersja BIOS nie rozpoznaje typu ROM BIOS. "
IDS_UNKNOWN_SIGN =      "Dostępna jest nowa wersja BIOS."
IDS_ROM_INFO =          "Informacje o ROM BIOS"
IDS_ROM_TYPE =          "Typ ROM:"
IDS_MODEL =             "Model:"
IDS_VERSION =           "Wersja:"
IDS_DATE =              "Data:"
IDS_IMAGE_INFO =        "Informacje o obrazie BIOS"
IDS_FILENAME =          "Nazwa pliku:"
IDS_MESSAGE =           "Komunikat"
IDS_ERASE =             "Usunięta zawartość pamięci ROM"
IDS_FLASH =             "Programowalna pamięć ROM"
IDS_VERIFY =            "Zweryfikowana pamięć ROM"
IDS_EXIT =              "Kliknij [Exit], aby opuścić ustawienia."
IDS_RETRY =             "Kliknij [Flash], aby spróbować ponownie lub [Exit], aby przerwać."
IDS_FORMAT_CONFIMED =   "Plik BIOS jest prawidłowy. Kliknij [Flash], aby zaktualizować BIOS."
IDS_BACKUP_FAILED =     "Nie powiodło się wykonanie kopii zapasowej pliku BIOS. "
IDS_INVALID_SIZE =      "Nieprawidłowa wielkość pliku BIOS. " 
IDS_BUF_ALLOC_FAILED =  "Nie można alokować bufora do zapisu pliku BIOS. "
IDS_UNKNOWN_FILE_VER =  "Nie można znaleźć wersji pliku BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Nie można znaleźć wersji ROM BIOS. "
IDS_MODEL_MISMATCHED =  "Wersja pliku BIOS nie pasuje do wersji ROM BIOS. "
IDS_DOWNGRADE =         "OSTRZEŻENIE: Plik BIOS jest starszy od bieżącej wersji. "
IDS_ERASING =           "Usuwanie zawartości ROM BIOS…. Zaczekaj kilka sekund na dokończenie procesu. NIE wyłączaj systemu podczas procesu usuwania, ponieważ może to spowodować awarię systemu."
IDS_ERASE_FAILED =      "Nie powiodło się usunięcie zawartości pamięci ROM BIOS. "
IDS_FLASHING =          "Aktualizacja ROM BIOS…. Zaczekaj kilka sekund na dokończenie procesu. NIE wyłączaj systemu podczas procesu aktualizacji, ponieważ może to spowodować awarię systemu."
IDS_FLASH_FAILED =      "Nie powiodła się aktualizacja ROM BIOS. "
IDS_VERIFYING =         "Weryfikacja wersji ROM BIOS…. Zaczekaj kilka sekund na dokończenie procesu. NIE wyłączaj systemu podczas procesu weryfikacji, ponieważ może to spowodować awarię systemu."
IDS_VERIFY_ALLOC =      "Nie powiodła się alokacja bufora do weryfikacji ROM BIOS. "
IDS_VERIFY_FAILED =     "Nie powiodło się dopasowanie ROM BIOS do nowego pliku BIOS. "
IDS_REBOOT =            "Aktualizacja powiodła się. Kliknij [Exit], aby ponownie uruchomić system."
IDS_SHUTDOWN =          "Aktualizacja powiodła się. Kliknij [Exit] w celu wyłączenia systemu. "
IDS_CMOS_CLEAR =        "CMOS automatycznie załaduje ustawienia domyślne."
IDS_ATP_NOTIME =        "Błąd Intel AT-p (Zabezpieczenie komputera PC przed kradzieżą): Pozostały czas może nie być wystarczający!"
IDS_POWER_PREREQUISITE ="Before running the program, ensure that the power adapter is plugged and the remaining battery power is at least 20%."
IDS_INVALID_BIOS =      "Invalid BIOS file"
IDS_REBOOT_SF20 =       "Click [Exit] for the system to auto-reboot and continue with the BIOS update process."

[BR]
IDS_ATK =               "Não pode abrir o driver no modo kernel ACPI ATK0100. Por favor, instale este driver primeiro."
IDS_UNSUPPORTED =       "O Programa da BIOS Flash não pode reconhecer o arquivo BIOS. Tente outra versão do arquivo BIOS." 
IDS_REMINDER =          "Este programa atualizará a BIOS.A atualização da BIOS é potencialmente de risco. Assim, só atualize sua BIOS se for absolutamente necessário. Antes de atualizar a BIOS, leia as informações de publicação da BIOS fornecida no site de download."
IDS_BROWSE =            "Navegue para procurar o arquivo BIOS."
IDS_RECONFIRM =         "VAROVÁNÍ: Nevhodnou aktualizací systému BIOS mohou vzniknout další problémy s notebookem. Aktualizujte systém BIOS pouze, pokud je to zcela nezbytné. WinFlash zaktualizuje systém BIOS a restartuje váš počítač.Chcete pokračovat?"
IDS_DEFAULT_ERROR =     "A atualização da BIOS não é permitida. Código do erro: "
IDS_UNFOUNDED_FILE =    "Não pode encontrar o arquivo BIOS: "
IDS_UNKNOWN_ROMTYPE =   "A BIOS atual não pode reconhecer o tipo BIOS ROM. "
IDS_UNKNOWN_SIGN =      "Não existe nenhuma versão BIOS nova."
IDS_ROM_INFO =          "Informação da BIOS ROM"
IDS_ROM_TYPE =          "Tipo de ROM:"
IDS_MODEL =             "Modelo:"
IDS_VERSION =           "Versão:"
IDS_DATE =              "Data:"
IDS_IMAGE_INFO =        "Informação de Imagens da BIOS"
IDS_FILENAME =          "Nome do Arquivo:"
IDS_MESSAGE =           "Mensagem"
IDS_ERASE =             "ROM Apagada"
IDS_FLASH =             "ROM Flash"
IDS_VERIFY =            "ROM Verificada"
IDS_EXIT =              "Clique em [Exit] para sair."
IDS_RETRY =             "Clique em [Flash] para tentar novamente ou [Exit] para abortar."
IDS_FORMAT_CONFIMED =   "O arquivo BIOS está correto. Clique em [Flash] para atualizar a BIOS."
IDS_BACKUP_FAILED =     "Falhou ao realizar a cópia de segurança do arquivo da BIOS. "
IDS_INVALID_SIZE =      "O tamanho do arquivo BIOS não é válido. " 
IDS_BUF_ALLOC_FAILED =  "Não pode alocar o buffer para armazenar o arquivo BIOS. "
IDS_UNKNOWN_FILE_VER =  "Não pode encontrar a versão do arquivo BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Não pode encontrar a versão ROM da BIOS. "
IDS_MODEL_MISMATCHED =  "A versão do arquivo BIOS não corresponde à versão ROM da BIOS. "
IDS_DOWNGRADE =         "ADVERTÊNCIA: O arquivo BIOS é mais antigo que a versão atual. "
IDS_ERASING =           "Por favor, aguarde por dois a três minutos para o processo de atualização da BIOS terminar. Durante o processo, a função Power off (Desligamento) é desabilitada para impedir falha do sistema."
IDS_ERASE_FAILED =      "Falha ao apagar o ROM da BIOS. "
IDS_FLASHING =          "Por favor, aguarde por dois a três minutos para o processo de atualização da BIOS terminar. Durante o processo, a função Power off (Desligamento) é desabilitada para impedir falha do sistema."
IDS_FLASH_FAILED =      "Falhou ao atualizar o ROM da BIOS. "
IDS_VERIFYING =         "Por favor, aguarde por dois a três minutos para o processo de atualização da BIOS terminar. Durante o processo, a função Power off (Desligamento) é desabilitada para impedir falha do sistema."
IDS_VERIFY_ALLOC =      "Falhou para alocar o buffer para a verificação do ROM da BIOS. "
IDS_VERIFY_FAILED =     "Falhou ao corresponder o ROM da BIOS com o novo arquivo da BIOS. "
IDS_REBOOT =            "A atualização foi realizada com sucesso. Clique em [Exit] para reiniciar o sistema. "
IDS_SHUTDOWN =          "A atualização foi realizada com sucesso. Clique em [Exit] para desligar o sistema. "
IDS_CMOS_CLEAR =        "O CMOS carrega automaticamente os ajustes predefinidos."
IDS_ATP_NOTIME =        "Erro Intel AT-p (Proteção do PC com Tecnologia Anti-Roubo): O tempo restante pode não ser suficiente!"
IDS_POWER_PREREQUISITE ="Antes de executar o programa, certifique-se que o adaptador de força esteja ligado e o restante de força da bateria seja no mínimo de 20%."
IDS_INVALID_BIOS =      "Arquivo de BIOS Inválido"
IDS_REBOOT_SF20 =       "Clique em [Exit] para o sistema auto-reiniciar e continuar com o processo de atualização da BIOS."

[PT]
IDS_ATK =               "Não é possível abrir o controlador do modo de kernel ACPI ATK0100. Instale primeiro este controlador."
IDS_UNSUPPORTED =       "O programa de flash do BIOS não reconhece o ficheiro do BIOS. Tente outra versão do ficheiro do BIOS."  
IDS_REMINDER =          "Este programa irá actualizar o BIOS.A actualização do BIOS é potencialmente perigosa, por isso deve actualizar o BIOS apenas quando for absolutamente necessário. Antes de actualizar o BIOS, leia as informações da versão do BIOS fornecidas na página de transferência."
IDS_BROWSE =            "Procurar o ficheiro do BIOS."
IDS_RECONFIRM =         "AVISO: A actualização inadequada do BIOS poderá criar mais problemas para o seu PC Portátil. Actualize o BIOS apenas quando for absolutamente necessário. O WinFlash irá actualizar o BIOS e reiniciar o seu sistema.Deseja continuar?"
IDS_DEFAULT_ERROR =     "A actualização do BIOS não é permitida. Código de erro: "
IDS_UNFOUNDED_FILE =    "Não é possível encontrar o ficheiro de BIOS: "
IDS_UNKNOWN_ROMTYPE =   "O BIOS actual não reconhece o tipo de ROM BIOS. "
IDS_UNKNOWN_SIGN =      "Não existe nenhuma nova versão do BIOS."
IDS_ROM_INFO =          "Informação da ROM BIOS"
IDS_ROM_TYPE =          "Tipo de ROM:"
IDS_MODEL =             "Modelo:"
IDS_VERSION =           "Versão:"
IDS_DATE =              "Data:"
IDS_IMAGE_INFO =        "Informação da imagem do BIOS"
IDS_FILENAME =          "Nome do ficheiro:"
IDS_MESSAGE =           "Mensagem"
IDS_ERASE =             "ROM apagada"
IDS_FLASH =             "ROM actualizada"
IDS_VERIFY =            "ROM verificada"
IDS_EXIT =              "Clique em [Exit] para sair."
IDS_RETRY =             "Clique em [Flash] para tentar novamente ou em [Exit] para abortar."
IDS_FORMAT_CONFIMED =   "O ficheiro do BIOS está correcto. Clique em [Flash] para actualizar o BIOS."
IDS_BACKUP_FAILED =     "Falha ao efectuar a cópia de segurança do ficheiro do BIOS. "
IDS_INVALID_SIZE =      "O tamanho do ficheiro do BIOS não é válido. " 
IDS_BUF_ALLOC_FAILED =  "Não é possível atribuir memória intermédia para armazenar o ficheiro do BIOS. "
IDS_UNKNOWN_FILE_VER =  "Não é possível encontrar a versão do ficheiro do BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Não é possível encontrar a versão da ROM BIOS. "
IDS_MODEL_MISMATCHED =  "A versão do ficheiro do BIOS não coincide com a versão da ROM BIOS. "
IDS_DOWNGRADE =         "AVISO: o ficheiro do BIOS é mais antigo do que a versão actual. "
IDS_ERASING =           "Aguarde dois a três minutos até que o processo de actualização do BIOS esteja concluído. Durante o processo, a função de Encerramento estará desactivada para evitar falhas no sistema."
IDS_ERASE_FAILED =      "Falha ao apagar a ROM BIOS. "
IDS_FLASHING =          "Aguarde dois a três minutos até que o processo de actualização do BIOS esteja concluído. Durante o processo, a função de Encerramento estará desactivada para evitar falhas no sistema."
IDS_FLASH_FAILED =      "Falha ao actualizar a ROM BIOS. "
IDS_VERIFYING =         "Aguarde dois a três minutos até que o processo de actualização do BIOS esteja concluído. Durante o processo, a função de Encerramento estará desactivada para evitar falhas no sistema."
IDS_VERIFY_ALLOC =      "Falha ao atribuir memória intermédia para a verificação da ROM BIOS. "
IDS_VERIFY_FAILED =     "Falha ao coincidir a ROM BIOS com o novo ficheiro do BIOS. "
IDS_REBOOT =            "Actualização bem sucedida. Clique em [Exit] para reiniciar o sistema. "
IDS_SHUTDOWN =          "Actualização bem sucedida. Clique em [Exit] para desligar o sistema. "
IDS_CMOS_CLEAR =        "O CMOS irá carregar automaticamente os valores predefinidos."
IDS_ATP_NOTIME =        "Erro Intel AT-p (Tecnologia Anti-roubo para Protecção de PC): O tempo restante poderá não ser suficiente!"
IDS_POWER_PREREQUISITE ="Antes de executar o programa, assegure-se de que o transformador se encontra ligado e que a bateria possui pelo menos 20% de energia."
IDS_INVALID_BIOS =      "Ficheiro de BIOS inválido"
IDS_REBOOT_SF20 =       "Clique em [Exit] para reiniciar automaticamente o sistema e continuar o processo de atualização do BIOS."

[RU]
IDS_ATK =               "Невозможно найти драйвер ядра ACPI ATK0100. Сначала установите драйвер."
IDS_UNSUPPORTED =       "Программа не может распознать файл BIOS. Попробуйте файл BIOS другой версии."  
IDS_REMINDER =          "Эта программа обновит BIOS.Есть риск неудачного обновления BIOS, поэтому обновляйте BIOS только в случае крайней необходимости. Перед обновлением, ознакомьтесь с предоставленной на сайте информацией о  BIOS."
IDS_BROWSE =            "Найти файл BIOS."
IDS_RECONFIRM =         "Внимание: Неосторожное обновление BIOS может создать дополнительные проблемы для Вашего ноутбука. Не обновляйте BIOS без необходимости. WinFlash обновит BIOS и перезагрузит компьютер.Вы хотите продолжить?"
IDS_DEFAULT_ERROR =     "Не разрешается обновление BIOS. Код ошибки: "
IDS_UNFOUNDED_FILE =    "Невозможно найти файл BIOS: "
IDS_UNKNOWN_ROMTYPE =   "Текущий BIOS не может распознать тип BIOS ROM. "
IDS_UNKNOWN_SIGN =      "Нет новой версии BIOS."
IDS_ROM_INFO =          "Информация о BIOS ROM"
IDS_ROM_TYPE =          "Тип ROM:"
IDS_MODEL =             "Модель:"
IDS_VERSION =           "Версия:"
IDS_DATE =              "Дата:"
IDS_IMAGE_INFO =        "Информация об образе BIOS"
IDS_FILENAME =          "Имя файла:"
IDS_MESSAGE =           "Сообщение"
IDS_ERASE =             "ROM стерт"
IDS_FLASH =             "ROM обновлен"
IDS_VERIFY =            "ROM проверен"
IDS_EXIT =              "Для выхода нажмите [Exit]."
IDS_RETRY =             "Нажмите [Flash] для повторной попытки или [Exit] для прекращения."
IDS_FORMAT_CONFIMED =   "Файл BIOS правильный. Нажмите [Flash] для обновления BIOS."
IDS_BACKUP_FAILED =     "Ошибка при резервном копировании файла BIOS. "
IDS_INVALID_SIZE =      "Неверный размер файла BIOS. " 
IDS_BUF_ALLOC_FAILED =  "Невозможно выделить буфер для сохранения файла BIOS. "
IDS_UNKNOWN_FILE_VER =  "Невозможно найти версию файла BIOS. "
IDS_UNKNOWN_BIOS_VER =  "Невозможно найти версию BIOS ROM. "
IDS_MODEL_MISMATCHED =  "Версия файла BIOS не совпадает с версией BIOS ROM. "
IDS_DOWNGRADE =         "Внимание! Версия файла BIOS старше текущей версии. "
IDS_ERASING =           "Пожалуйста, подождите две-три минуты до завершения обновления BIOS. При обновлении функция Выключения питания отключена, во избежание сбоя системы."
IDS_ERASE_FAILED =      "Ошибка при стирании BIOS ROM. "
IDS_FLASHING =          "Пожалуйста, подождите две-три минуты до завершения обновления BIOS. При обновлении функция Выключения питания отключена, во избежание сбоя системы."
IDS_FLASH_FAILED =      "Ошибка при обновлении BIOS ROM. "
IDS_VERIFYING =         "Пожалуйста, подождите две-три минуты до завершения обновления BIOS. При обновлении функция Выключения питания отключена, во избежание сбоя системы."
IDS_VERIFY_ALLOC =      "Ошибка при выделении буфера для проверки BIOS ROM. "
IDS_VERIFY_FAILED =     "Ошибка при сравнении BIOS ROM с новым файлом BIOS. "
IDS_REBOOT =            "Обновление успешно завершено. Нажмите [Exit] для перезагрузки системы."
IDS_SHUTDOWN =          "Обновление успешно завершено. Нажмите [Exit] для выключения системы."
IDS_CMOS_CLEAR =        "CMOS автоматически загрузит параметры по умолчанию."
IDS_ATP_NOTIME =        "Ошибка Intel AT-p (Anti-Theft Technology PC Protection) Ошибка: Оставшегося времени может быть недостаточно!"
IDS_POWER_PREREQUISITE ="Перед запуском программы убедитесь, что блок питания подключен и оставшийся заряд аккумулятора составляет не менее 20%."
IDS_INVALID_BIOS =      "Неверный файл BIOS"
IDS_REBOOT_SF20 =       "Нажмите [Exit] для перезагрузки и обновления BIOS."

[SI]
IDS_ATK =               "Ni mogoče odpreti gonilnika jedrnega načina ACPI ATK0100. Prosimo, najprej namestite gonilnik."
IDS_UNSUPPORTED =       "Program za posodobitev BIOS-a ne more prepoznati datoteke BIOS. Poskusite z drugo različico datoteke BIOS."  
IDS_REMINDER =          "Ta program bo posodobil BIOS.Posodabljanje BIOS-a je potencialno tvegano, zato ga posodabljajte le, če je absolutno nujno. Pred posodabljanjem BIOS-a preberite informacije o izdaji BIOS-a, ki jih dobite na strani za prenos."
IDS_BROWSE =            "Poiščite datoteko BIOS."
IDS_RECONFIRM =         "OPOZORILO: Neprimerno posodabljanje BIOS-a lahko povzroči več težav na prenosnem računalniku. BIOS posodobite le, če je absolutno nujno. WinFlash bo BIOS posodobil in ponovno zagnal vaš sistem.Ali želite nadaljevati?"
IDS_DEFAULT_ERROR =     "Posodobitev BIOS ni dovoljena. Koda napake: "
IDS_UNFOUNDED_FILE =    "Ni mogoče najti datoteke BIOS: "
IDS_UNKNOWN_ROMTYPE =   "Trenutni BIOS ne more prepoznati vrste BIOS ROM-a. "
IDS_UNKNOWN_SIGN =      "Nova različica BIOS-a ne obstaja."
IDS_ROM_INFO =          "Informacije BIOS ROM"
IDS_ROM_TYPE =          "Vrsta ROM:"
IDS_MODEL =             "Model:"
IDS_VERSION =           "Različica:"
IDS_DATE =              "Datum:"
IDS_IMAGE_INFO =        "Informacije BIOS Image"
IDS_FILENAME =          "Ime datoteke:"
IDS_MESSAGE =           "Sporočilo"
IDS_ERASE =             "Izbrisan ROM"
IDS_FLASH =             "Posodobljen ROM"
IDS_VERIFY =            "Preverjen ROM"
IDS_EXIT =              "Kliknite [Exit] za izhod."
IDS_RETRY =             "Kliknite [Flash] za ponoven poizkus ali [Exit] za prekinitev."
IDS_FORMAT_CONFIMED =   "Datoteka BIOS je prava. Kliknite [Flash] za posodobitev BIOS-a."
IDS_BACKUP_FAILED =     "Varnostno kopiranje datoteke BIOS ni uspelo. "
IDS_INVALID_SIZE =      "Velikost datoteke BIOS ni veljavna. " 
IDS_BUF_ALLOC_FAILED =  "Ni mogoče dodeliti predpomnilnika za shranjevanje datoteke BIOS. "
IDS_UNKNOWN_FILE_VER =  "Različice datoteke BIOS ni mogoče najti. "
IDS_UNKNOWN_BIOS_VER =  "Različice BIOS ROM ni mogoče najti. "
IDS_MODEL_MISMATCHED =  "Različica datoteke BIOS se ne ujema z različico BIOS ROM. "
IDS_DOWNGRADE =         "OPOZORILO: Datoteka BIOS je starejša od trenutne različice. "
IDS_ERASING =           "Brisanje BIOS ROM-a ... Prosimo, počakajte nekaj sekund, da se postopek zaključi. NE izključite sistema med postopkom brisanja, saj lahko to povzroči sistemsko napako."
IDS_ERASE_FAILED =      "Brisanje BIOS ROM-a ni uspelo. "
IDS_FLASHING =          "Posodabljanje BIOS ROM-a ... Prosimo, počakajte nekaj sekund, da se postopek zaključi. NE izključite sistema med postopkom posodabljanja, saj lahko to povzroči sistemsko napako."
IDS_FLASH_FAILED =      "Posodabljanje BIOS ROM-a ni uspelo. "
IDS_VERIFYING =         "Preverjanje različice BIOS ROM ... Prosimo, počakajte nekaj sekund, da se postopek zaključi. NE izključite sistema med postopkom preverjanja, saj lahko to povzroči sistemsko napako."
IDS_VERIFY_ALLOC =      "Dodeljevanje pomnilnika za preverjanje BIOS ROM-a ni uspelo. "
IDS_VERIFY_FAILED =     "BIOS ROM-a ni bilo mogoče povezati z novo datoteko BIOS. "
IDS_REBOOT =            "Posodobitev je bila uspešna. Kliknite [Exit] za ponoven zagon sistema. "
IDS_SHUTDOWN =          "Posodobitev je bila uspešna. Kliknite [Exit] za zaustavitev sistema. "
IDS_CMOS_CLEAR =        "CMOS samodejno naloži privzete nastavitve."
IDS_ATP_NOTIME =        "Intel AT-p (Tehnologija zaščite računalnika proti kraji) Napaka: Preostali čas morda ne bo zadostoval!"
IDS_POWER_PREREQUISITE ="Before running the program, ensure that the power adapter is plugged and the remaining battery power is at least 20%."
IDS_INVALID_BIOS =      "Invalid BIOS file"
IDS_REBOOT_SF20 =       "Click [Exit] for the system to auto-reboot and continue with the BIOS update process."